const catalog = [
    {
        name: "Шоссейные",
        products: [
            {
            name: "Giant TCR Advanced",
            description:
                "Велосипед Giant TCR Advanced SL Disc 0 DA - это улучшенная версия,\
                которая обеспечивает максимальную эффективность и отличные результаты в гонках.\
                Сочетание высокой жесткости вращения педалей к весу и формы аэрокамеры \
                позволяют этому байку обеспечивать лучшие возможности подъема, аэродинамическую \
                эффективность и спринтскую жесткость.",
            price: "7680",
            },
            {
            name: "BIANCHI SPECIALISSIMA CV",
            description:
                "Bianchi Specialissima CV Ultegra Di2 – это топовый шоссейный велосипед от одного из\
                 авторитетнейших брендов велоиндустрии. Данная модель создана для профессиональных гонок\
                 и именно в них сможет полностью раскрыть как свой, так и гонщика потенциал.\
                 Собран байк на карбоновой фреймсете и таких же колесах, оснащен навесным оборудованием\
                 с электрическим приводом переключения передач и классическими ободными тормозами.",
            price: "8900",
            },
            {
            name: "ORBEA ORCA AERO",
            description:
                "Orbea Orca Aero M30 Team – профессиональный аэрошоссейный велосипед от испанского\
                 производителя. Этот байк создан для гонок и тренировок профессиональных спортсменов,\
                 а потому в нем стоит акцент на эффективности, скорости и жесткости. Собран байк\
                 на карбоновой фреймсете и вилсете Fulcrum, оснащен трансмиссией Shimano 105 и\
                 дисковой гидравликой.",
            price:"7990",
            },
       ],
    },
    {
        name: "Горные",
        products: [
            {
            name: "HAIBIKE XDURO ALLTRAIL",
            description:
                "Haibike XDURO AllTrail Flyon 5.0 – это электровелосипед на 27.5 колесах с\
                 кареточным двигателем. Байк произведен немецким премиальным брендом, который является\
                 первооткрывателем и мире электровелосипедов. Данная модель рассчитана на любиетлькую\
                 кросс-кантрийную эксплуатацию. Байк придется по вкусу как тем, кто просто хочет\
                 увеличить дальность своих покатушек, так и тем, кто тренируется. Ассистентный\
                 двигатель поможет реализовать и нарастить спортивный потенциал райдера.",
            price:"4700",
            },
            {
            name: "BOTTECCHIA E-FULL QUASAR",
            description:
                "Двухподвесный электровелосипед BOTTECCHIA E-FULL QUASAR 27.5 – это AllMountain байк,\
                 который будет превосходным тренажером как для профессиональных спортсменов, так\
                 и для любителей. Карбоновая рама и топовая амортизационная вилка Rock Shox PIKE,\
                 трансмиссия и тормоза Shimano XT, электропривод от Shimano – все это кроется под\
                 названием BOTTECCHIA E-FULL QUASAR.",
            price:"5340",
            },
            {
            name: "GIANT GLORY 1",
            description:
                "Giant Glory 1 27,5 – легендарный байк для стремительных спусков от всемирно\
                 известного бренда! В нем собраны все передовые наработки и опыт компании для\
                 достижения максимального контроля велосипеда на трассе и обеспечения максимальной\
                 прочности и надежности.",
            price:"3999",
            },
        ],
    },
    {
        name: "Городские",
        products: [
            {
            name: "MOMENTUM TRANSEND E+ GTS 25",
            description:
                "Электровелосипед Momentum Transend E GTS 25 - это инновационный велосипед,\
                 оснащенный двигателем SyncDrive Life, который использует технологию Smart Assist.\
                 Система состоит из шести датчиков, которые вычисляют крутящий момент, частоту\
                 педалирования, наклон и скорость. Благодаря этому электровелосипед предоставляет плавную\
                 и мощную помощь при педалировании, что делает его идеальным выбором для любителей быстрой\
                 езды. С таким велосипедом Вы можете мчаться по дороге на максимальной скорости, чувствуя\
                 мощный поток ветра в лицо.",
            price:"2450",
            },
            {
            name: "GRAZIELLA GOLD",
            description:
                "Graziella празднует 50-ти летие. Полвека отделяет нас от рождения легенды Graziella.\
                 В честь 50-летия, компания подготовила специальную ограниченную версию своего велосипеда\
                  — Graziella Gold Edition. Жемчужина среди велосипедов, модель у которой рама и вилка\
                  полностью покрыты 24K золотом, а детали инкрустированы деревом. Graziella подчеркивает\
                  ювелирное внимание к деталям и постоянным техническим инновациям,\
                  не забывая свои исторические корни.",
            price:"3750",
            },
            {
            name: "MANDO FOOTLOOSE G2",
            description:
                "Уникальный городской электробайк Mando Footloose, спроектирован знаменитым английским\
                 дизайнером Марком Сандерсом. Footloose - новая модель, которая позволит вам выразить ваш\
                 стиль при помощи расширенной палитры цветов. Индивидуальные средства передвижения никогда\
                 не были столь выразительны. Mando Footloose не использует цепей, которые стали символом\
                 велосипедов, заменив их Серийной Гибридной Системой (Series Hybrid System), что позволяет\
                 передвигаться на данном транспортном средстве также удобно, как и на автомобиле.",
            price:"4190",
            },
        ],
    },
];

const titles = {
    buyButtonTitle: "Купить",
    regButtonTitle: "Регистрация"
};